#Задача 1
# i = 0
# for i in range (1, 11):
#     print("5 x", i, "=", 5 * i)


#Задача 2
# n = int(input("Введите число N: "))
# total = 0
# for i in range(1, n + 1):
#     total = total + i
# print(f"Сумма чисел от 1 до {n} = {total}")